<img src="img/Recurso-26.png" width="200">

## TERCER MODULO -  Estructuras de datos, +Pandas

![logo](img/python_logo.png)

*Steven Chuiza*

In [1]:
import pandas as pd
import numpy as np

### Operaciones en Pandas

#### Busqueda

In [2]:
rand_matrix = np.random.randint(6,size=(2,3))
frame = pd.DataFrame(rand_matrix , columns=list('ABC'))
display(frame)

   A  B  C
0  5  1  1
1  2  2  0

In [3]:
# buscando columnas (DataFrame como dic, busca en claves)
'A' in frame

True

In [4]:
# buscando valores
display(frame.isin([3,2])) # --> mask de respuesta (valores que son 3 o 2)

       A      B      C
0  False  False  False
1   True   True  False

In [5]:
#Contar el número de ocurrencias
print(frame.isin([4]).values.sum())
display(frame.isin([4])) #devuelve una mask con valores true si el elemento es 4
print(frame.isin([4]).values)
type(frame.isin([4]).values) # pandas es una capa alrededor de numpy

0

       A      B      C
0  False  False  False
1  False  False  False

[[False False False]
 [False False False]]

numpy.ndarray

In [6]:
# Cuántos valores son >= 2
mask = frame >= 2
print(mask.values.sum())
display(mask)

3

      A      B      C
0  True  False  False
1  True   True  False

#### Ordenacion

In [7]:
from random import shuffle
rand_matrix = np.random.randint(20,size=(5,4))
indices = list(range(5))
shuffle(indices) # mezcla indices
frame = pd.DataFrame(rand_matrix , columns=list('DACB'), index=indices)
display(frame)

    D   A   C   B
1   4   2  14   1
4   7  14  12  18
3   2   4  19  16
2  12   2  12   4
0   1  15   3  17

In [8]:
# ordenar por índice
display(frame.sort_index(ascending=False))
display(frame)

    D   A   C   B
4   7  14  12  18
3   2   4  19  16
2  12   2  12   4
1   4   2  14   1
0   1  15   3  17

    D   A   C   B
1   4   2  14   1
4   7  14  12  18
3   2   4  19  16
2  12   2  12   4
0   1  15   3  17

In [9]:
#ordenar por columna
display(frame.sort_index(axis=1, ascending=False))

    D   C   B   A
1   4  14   1   2
4   7  12  18  14
3   2  19  16   4
2  12  12   4   2
0   1   3  17  15

In [10]:
# ordenar filas por valor en columna
display(frame.sort_values(by='A', ascending=True))

    D   A   C   B
1   4   2  14   1
2  12   2  12   4
3   2   4  19  16
4   7  14  12  18
0   1  15   3  17

In [11]:
# ordenar columnas por valor en fila
display(frame.sort_values(by=1, axis=1, ascending=True))

    B   A   D   C
1   1   2   4  14
4  18  14   7  12
3  16   4   2  19
2   4   2  12  12
0  17  15   1   3

In [12]:
# ordenar por valor en columna y guardar cambios
frame.sort_values(by='A', ascending=False, inplace=True)
display(frame)

    D   A   C   B
0   1  15   3  17
4   7  14  12  18
3   2   4  19  16
1   4   2  14   1
2  12   2  12   4

#### Ranking
* Construir un ranking de valores

In [13]:
display(frame)

    D   A   C   B
0   1  15   3  17
4   7  14  12  18
3   2   4  19  16
1   4   2  14   1
2  12   2  12   4

In [14]:
display(frame.rank(method='max', axis=1))

     D    A    C    B
0  1.0  3.0  2.0  4.0
4  1.0  3.0  2.0  4.0
3  1.0  2.0  4.0  3.0
1  3.0  2.0  4.0  1.0
2  4.0  1.0  4.0  2.0

In [15]:
# Imprimir, uno a uno, los valores de la columna 'C' de mayor a menor
for x in frame.sort_values(by='C', ascending=False)['C'].values:
    print(x)

19
14
12
12
3

#### Operaciones

Operaciones matemáticas entre objetos

In [17]:
matrixA = np.random.randint(100,size=(4,4))
matrixB = np.random.randint(100,size=(4,4))
frameA = pd.DataFrame(matrixA)
frameB = pd.DataFrame(matrixB)
display(frameA)
display(frameB)

    0   1   2   3
0   8  43  36  42
1  35  10  83  54
2  62  81  91  64
3  11  69  63   7

    0   1   2   3
0  61  12  94  23
1  29  35   0  43
2  75  36  50  73
3  61  55  29  35

In [18]:
# a través de métodos u operadores
display(frameA + frameB == frameA.add(frameB))
display(frameA + frameB)

      0     1     2     3
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True
3  True  True  True  True

     0    1    2    3
0   69   55  130   65
1   64   45   83   97
2  137  117  141  137
3   72  124   92   42

In [19]:
display(frameB - frameA == frameB.sub(frameA))
display(frameB - frameA)

      0     1     2     3
0  True  True  True  True
1  True  True  True  True
2  True  True  True  True
3  True  True  True  True

    0   1   2   3
0  53 -31  58 -19
1  -6  25 -83 -11
2  13 -45 -41   9
3  50 -14 -34  28

In [20]:
# si los frames no son iguales, valor por defecto NaN
frameC = pd.DataFrame(np.random.randint(100,size=(3,3)))
display(frameA)
display(frameC)
display(frameC + frameA)

    0   1   2   3
0   8  43  36  42
1  35  10  83  54
2  62  81  91  64
3  11  69  63   7

    0   1   2
0  44  21  86
1  15  22   2
2  41  94  60

       0      1      2   3
0   52.0   64.0  122.0 NaN
1   50.0   32.0   85.0 NaN
2  103.0  175.0  151.0 NaN
3    NaN    NaN    NaN NaN